garyPenhook/PyAvrOCD/svd/atmega3290.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>BOOT_LOAD</name>
      <description>Bootloader</description>
      <baseAddress>0x00800057</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>SPMCSR</name>
          <description>Store Program Memory Control Register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SPMEN</name>
              <description>Store Program Memory Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PGERS</name>
              <description>Page Erase</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PGWRT</name>
              <description>Page Write</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BLBSET</name>
              <description>Boot Lock Bit Set</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RWWSRE</name>
              <description>Read While Write section read enable</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RWWSB</name>
              <description>Read While Write Section Busy</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SPMIE</name>
              <description>SPM Interrupt Enable</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>CPU</name>
      <description>CPU Registers</description>
      <baseAddress>0x0080003E</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0xC</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x15</offset>
        <size>0x3</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x1F</offset>
        <size>0x3</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x23</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x26</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x28</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>RESET</name>
        <description>External Pin,Power-on Reset,Brown-out Reset,Watchdog Reset,and JTAG AVR Reset. See Datasheet.     </description>
        <value>0</value>
      </interrupt>
      <interrupt>
        <name>INT0</name>
        <description>External Interrupt Request 0</description>
        <value>1</value>
      </interrupt>
      <interrupt>
        <name>PCINT0</name>
        <description>Pin Change Interrupt Request 0</description>
        <value>2</value>
      </interrupt>
      <interrupt>
        <name>PCINT1</name>
        <description>Pin Change Interrupt Request 1</description>
        <value>3</value>
      </interrupt>
      <interrupt>
        <name>TIMER2_COMP</name>
        <description>Timer/Counter2 Compare Match</description>
        <value>4</value>
      </interrupt>
      <interrupt>
        <name>TIMER2_OVF</name>
        <description>Timer/Counter2 Overflow</description>
        <value>5</value>
      </interrupt>
      <interrupt>
        <name>TIMER1_CAPT</name>
        <description>Timer/Counter1 Capture Event</description>
        <value>6</value>
      </interrupt>
      <interrupt>
        <name>TIMER1_COMPA</name>
        <description>Timer/Counter1 Compare Match A</description>
        <value>7</value>
      </interrupt>
      <interrupt>
        <name>TIMER1_COMPB</name>
        <description>Timer/Counter Compare Match B</description>
        <value>8</value>
      </interrupt>
      <interrupt>
        <name>TIMER1_OVF</name>
        <description>Timer/Counter1 Overflow</description>
        <value>9</value>
      </interrupt>
      <interrupt>
        <name>TIMER0_COMP</name>
        <description>Timer/Counter0 Compare Match</description>
        <value>10</value>
      </interrupt>
      <interrupt>
        <name>TIMER0_OVF</name>
        <description>Timer/Counter0 Overflow</description>
        <value>11</value>
      </interrupt>
      <interrupt>
        <name>SPI_STC</name>
        <description>SPI Serial Transfer Complete</description>
        <value>12</value>
      </interrupt>
      <interrupt>
        <name>USART_RX</name>
        <description>USART, Rx Complete</description>
        <value>13</value>
      </interrupt>
      <interrupt>
        <name>USART_UDRE</name>
        <description>USART Data register Empty</description>
        <value>14</value>
      </interrupt>
      <interrupt>
        <name>USART0_TX</name>
        <description>USART0, Tx Complete</description>
        <value>15</value>
      </interrupt>
      <interrupt>
        <name>USI_START</name>
        <description>USI Start Condition</description>
        <value>16</value>
      </interrupt>
      <interrupt>
        <name>USI_OVERFLOW</name>
        <description>USI Overflow</description>
        <value>17</value>
      </interrupt>
      <interrupt>
        <name>ANALOG_COMP</name>
        <description>Analog Comparator</description>
        <value>18</value>
      </interrupt>
      <interrupt>
        <name>ADC</name>
        <description>ADC Conversion Complete</description>
        <value>19</value>
      </interrupt>
      <interrupt>
        <name>EE_READY</name>
        <description>EEPROM Ready</description>
        <value>20</value>
      </interrupt>
      <interrupt>
        <name>SPM_READY</name>
        <description>Store Program Memory Read</description>
        <value>21</value>
      </interrupt>
      <interrupt>
        <name>LCD</name>
        <description>LCD Start of Frame</description>
        <value>22</value>
      </interrupt>
      <interrupt>
        <name>PCINT2</name>
        <description>Pin Change Interrupt Request 2</description>
        <value>23</value>
      </interrupt>
      <interrupt>
        <name>PCINT3</name>
        <description>Pin Change Interrupt Request 3</description>
        <value>24</value>
      </interrupt>
      <registers>
        <register>
          <name>CLKPR</name>
          <description>Clock Prescale Register</description>
          <addressOffset>0x23</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CLKPS</name>
              <description>Clock Prescaler Select Bits</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>1</name>
                  <description>1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2</name>
                  <description>2</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4</name>
                  <description>4</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8</name>
                  <description>8</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>16</name>
                  <description>16</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>32</name>
                  <description>32</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>64</name>
                  <description>64</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>128</name>
                  <description>128</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>256</name>
                  <description>256</description>
                  <value>8</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLKPCE</name>
              <description>Clock Prescaler Change Enable</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPIOR0</name>
          <description>General Purpose IO Register 0</description>
          <addressOffset>0x0</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>GPIOR1</name>
          <description>General Purpose IO Register 1</description>
          <addressOffset>0xC</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>GPIOR2</name>
          <description>General Purpose IO Register 2</description>
          <addressOffset>0xD</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>MCUCR</name>
          <description>MCU Control Register</description>
          <addressOffset>0x17</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>IVCE</name>
              <description>Interrupt Vector Change Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IVSEL</name>
              <description>Interrupt Vector Select</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PUD</name>
              <description>Pull-up disable</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MCUSR</name>
          <description>MCU Status Register</description>
          <addressOffset>0x16</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PORF</name>
              <description>Power-on reset flag</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EXTRF</name>
              <description>External Reset Flag</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BORF</name>
              <description>Brown-out Reset Flag</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WDRF</name>
              <description>Watchdog Reset Flag</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>JTRF</name>
              <description>JTAG Reset Flag</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OSCCAL</name>
          <description>Oscillator Calibration Value</description>
          <addressOffset>0x28</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>OSCCAL</name>
              <description>Oscillator Calibration </description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>PRR</name>
          <description>Power Reduction Register</description>
          <addressOffset>0x26</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PRADC</name>
              <description>Power Reduction ADC</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PRUSART0</name>
              <description>Power Reduction USART</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PRSPI</name>
              <description>Power Reduction Serial Peripheral Interface</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PRTIM1</name>
              <description>Power Reduction Timer/Counter1</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PRLCD</name>
              <description>Power Reduction LCD</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SMCR</name>
          <description>Sleep Mode Control Register</description>
          <addressOffset>0x15</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SE</name>
              <description>Sleep Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SM</name>
              <description>Sleep Mode Select bits</description>
              <bitRange>[3:1]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IDLE</name>
                  <description>Idle</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC</name>
                  <description>ADC Noise Reduction (If Available)</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDOWN</name>
                  <description>Power Down</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PSAVE</name>
                  <description>Power Save</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VAL_0x04</name>
                  <description>Reserved</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VAL_0x05</name>
                  <description>Reserved</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STDBY</name>
                  <description>Standby</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VAL_0x07</name>
                  <description>Reserved</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SP</name>
          <description>Stack Pointer </description>
          <addressOffset>0x1F</addressOffset>
          <size>0x10</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>65535</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>SREG</name>
          <description>Status Register</description>
          <addressOffset>0x21</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>C</name>
              <description>Carry Flag</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>Z</name>
              <description>Zero Flag</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>N</name>
              <description>Negative Flag</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>V</name>
              <description>Two's Complement Overflow Flag</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>S</name>
              <description>Sign Bit</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>H</name>
              <description>Half Carry Flag</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>T</name>
              <description>Bit Copy Storage</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>I</name>
              <description>Global Interrupt Enable</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
